```
krishna@turbotindias-MacBook-Pro azure_check_stack % terraform apply
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.azure_subscription_monitor_stack will be created
  + resource "turbot_policy_setting" "azure_subscription_monitor_stack" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure#/policy/types/subscriptionStack"
      + value                        = "Check: Configured"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_subscription_monitor_stack_source will be created
  + resource "turbot_policy_setting" "azure_subscription_monitor_stack_source" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure#/policy/types/subscriptionStackSource"
      + value                        = <<~EOT
            resource "azurerm_resource_group" "demo_rg" {
              name     = "turbot_stack_demo"
              location = "East US"
            
              tags = {
                environment = "demo"
              }
            }
            
            resource "azurerm_monitor_action_group" "demo_rg" {
                name = "turbot_monitor_action_group_demo"
                resource_group_name = "${azurerm_resource_group.demo_rg.name}"
                short_name  = "eventHandler"
                tags = {
                  environment = "demo"
              }
              }
              resource "azurerm_monitor_activity_log_alert" "turbot_azure_event_handler_activity_Log_Alert" {
                name                = "turbot_monitor_log_alert_demo"
                resource_group_name = "${azurerm_resource_group.demo_rg.name}"
                scopes              = ["${azurerm_resource_group.demo_rg.id}"]
            
                criteria {
                category       = "Administrative"
                status         = "Succeeded"
                level          = "Informational"
                }
            
                tags = {
                  environment = "demo"
                }
            
                action {
                  action_group_id = "${azurerm_monitor_action_group.demo_rg.id}"
                }
              }
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_subscription_monitor_stack_tfversion will be created
  + resource "turbot_policy_setting" "azure_subscription_monitor_stack_tfversion" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure#/policy/types/subscriptionStackTerraformVersion"
      + value                        = "0.13.*"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.azure_stack will be created
  + resource "turbot_smart_folder" "azure_stack" {
      + description = "Defines sets of policies for the Azure Stack baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "Azure Stack Example Policies"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.azure_stack: Creating...
turbot_smart_folder.azure_stack: Creation complete after 2s [id=216454808127259]
turbot_policy_setting.azure_subscription_monitor_stack: Creating...
turbot_policy_setting.azure_subscription_monitor_stack_tfversion: Creating...
turbot_policy_setting.azure_subscription_monitor_stack_source: Creating...
turbot_policy_setting.azure_subscription_monitor_stack: Creation complete after 1s [id=216454810424097]
turbot_policy_setting.azure_subscription_monitor_stack_tfversion: Creation complete after 2s [id=216454810602283]
turbot_policy_setting.azure_subscription_monitor_stack_source: Creation complete after 2s [id=216454810501927]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

Outputs:

smart_folder_description = Defines sets of policies for the Azure Stack baseline
smart_folder_name = Azure Stack Example Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher